# 1. Data import & raw data information.

In [1]:
import pandas as pd
import numpy as np
pd.set_option("display.max_columns", None)

In [2]:
df=pd.read_csv(r'C:\Users\alexd\Ironhack\Proyectos\Project2_DA_Ironhack\Raw - Data\w3-Database-Project-main\data\old_HDD.csv')

df.head()

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [3]:
dim_orig=df.shape
dim_orig

(1000, 5)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   first_name    1000 non-null   object
 1   last_name     1000 non-null   object
 2   title         1000 non-null   object
 3   release_year  1000 non-null   int64
 4   category_id   1000 non-null   int64
dtypes: int64(2), object(3)
memory usage: 39.2+ KB

# 2. Data Cleaning.
### Null Values

In [5]:
nan_cols=df.isnull().sum()
nan_cols[nan_cols>0]     # all of the columns have null values.

Series([], dtype: int64)

# 3.Determination of data type per column:

In [6]:
df.first_name.unique()

array(['PENELOPE', 'NICK', 'ED', 'JENNIFER', 'JOHNNY', 'BETTE', 'GRACE',
       'MATTHEW', 'JOE', 'CHRISTIAN', 'ZERO', 'KARL', 'UMA', 'VIVIEN',
       'CUBA', 'FRED', 'HELEN', 'DAN', 'BOB', 'LUCILLE', 'KIRSTEN',
       'ELVIS', 'SANDRA', 'CAMERON', 'KEVIN', 'RIP', 'JULIA', 'WOODY',
       'ALEC', 'SISSY', 'TIM', 'MILLA', 'AUDREY', 'JUDY', 'BURT', 'VAL',
       'TOM', 'GOLDIE'], dtype=object)

In [7]:
df.last_name.unique()

array(['GUINESS', 'WAHLBERG', 'CHASE', 'DAVIS', 'LOLLOBRIGIDA',
       'NICHOLSON', 'MOSTEL', 'JOHANSSON', 'SWANK', 'GABLE', 'CAGE',
       'BERRY', 'WOOD', 'BERGEN', 'OLIVIER', 'COSTNER', 'VOIGHT', 'TORN',
       'FAWCETT', 'TRACY', 'PALTROW', 'MARX', 'KILMER', 'STREEP', 'BLOOM',
       'CRAWFORD', 'MCQUEEN', 'HOFFMAN', 'WAYNE', 'PECK', 'SOBIESKI',
       'HACKMAN', 'DEAN', 'DUKAKIS', 'BOLGER', 'MCKELLEN', 'BRODY'],
      dtype=object)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   first_name    1000 non-null   object
 1   last_name     1000 non-null   object
 2   title         1000 non-null   object
 3   release_year  1000 non-null   int64
 4   category_id   1000 non-null   int64
dtypes: int64(2), object(3)
memory usage: 39.2+ KB

In [9]:
df.head()

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [10]:
df.drop_duplicates().shape==df.shape # no hay duplicados

True

In [11]:
df.to_csv(r'C:\Users\alexd\Ironhack\Proyectos\Project2_DA_Ironhack\Cleaned_data\old_HDD_cleaned.csv', index=False)

In [12]:
df['complete_name']=df.first_name + '_'+ df.last_name
df.head()

,first_name,last_name,title,release_year,category_id,complete_name
0,PENELOPE,GUINESS,ACADEMY DINOSAUR,2006,6,PENELOPE_GUINESS
1,PENELOPE,GUINESS,ANACONDA CONFESSIONS,2006,2,PENELOPE_GUINESS
2,PENELOPE,GUINESS,ANGELS LIFE,2006,13,PENELOPE_GUINESS
3,PENELOPE,GUINESS,BULWORTH COMMANDMENTS,2006,10,PENELOPE_GUINESS
4,PENELOPE,GUINESS,CHEAPER CLYDE,2006,14,PENELOPE_GUINESS

In [13]:
df.to_csv(r'C:\Users\alexd\Ironhack\Proyectos\Project2_DA_Ironhack\Cleaned_data\old_HDD_cleaned.csv', index=False)

In [14]:
sorted_df = df.sort_values(by='title')
sorted_df

,first_name,last_name,title,release_year,category_id,complete_name
0,PENELOPE,GUINESS,ACADEMY DINOSAUR,2006,6,PENELOPE_GUINESS
780,SANDRA,PECK,ACADEMY DINOSAUR,2006,6,SANDRA_PECK
212,CHRISTIAN,GABLE,ACADEMY DINOSAUR,2006,6,CHRISTIAN_GABLE
489,LUCILLE,TRACY,ACADEMY DINOSAUR,2006,6,LUCILLE_TRACY
464,BOB,FAWCETT,ACE GOLDFINGER,2006,11,BOB_FAWCETT
...,...,...,...,...,...,...
65,ED,CHASE,YOUNG LANGUAGE,2006,6,ED_CHASE
719,JULIA,MCQUEEN,YOUNG LANGUAGE,2006,6,JULIA_MCQUEEN
608,SANDRA,KILMER,YOUTH KICK,2006,12,SANDRA_KILMER
967,VAL,BOLGER,YOUTH KICK,2006,12,VAL_BOLGER
324,UMA,WOOD,ZHIVAGO CORE,2006,11,UMA_WOOD

In [15]:
df.head()

,first_name,last_name,title,release_year,category_id,complete_name
0,PENELOPE,GUINESS,ACADEMY DINOSAUR,2006,6,PENELOPE_GUINESS
1,PENELOPE,GUINESS,ANACONDA CONFESSIONS,2006,2,PENELOPE_GUINESS
2,PENELOPE,GUINESS,ANGELS LIFE,2006,13,PENELOPE_GUINESS
3,PENELOPE,GUINESS,BULWORTH COMMANDMENTS,2006,10,PENELOPE_GUINESS
4,PENELOPE,GUINESS,CHEAPER CLYDE,2006,14,PENELOPE_GUINESS

In [16]:
df.to_csv(r'C:\Users\alexd\Ironhack\Proyectos\Project2_DA_Ironhack\Cleaned_data\old_hdd.csv', index=False)

In [23]:
df2=pd.read_excel(r'C:\Users\alexd\OneDrive\Escritorio\old_hdd.xls')
df2

     actor_id  film_id                  title     complete_name  category_id
0           1        1       ACADEMY DINOSAUR  PENELOPE_GUINESS            6
1           1       23   ANACONDA CONFESSIONS  PENELOPE_GUINESS            2
2           1       25            ANGELS LIFE  PENELOPE_GUINESS           13
3           1      106  BULWORTH COMMANDMENTS  PENELOPE_GUINESS           10
4           1      140          CHEAPER CLYDE  PENELOPE_GUINESS           14
..        ...      ...                    ...               ...          ...
995        39      168      COMANCHEROS ENEMY      GOLDIE_BRODY            3
996        39      203        DAISY MENAGERIE      GOLDIE_BRODY           14
997        39      222        DESERT POSEIDON      GOLDIE_BRODY           11
998        39      290         EVERYONE CRAFT      GOLDIE_BRODY            9
999        39      293         EXORCIST STING      GOLDIE_BRODY           15

[1000 rows x 5 columns]

In [24]:
df2.to_csv(r'C:\Users\alexd\Ironhack\Proyectos\Project2_DA_Ironhack\Cleaned_data\actor_has_film.csv', index=False)